# ДЗ. Задача 16.
# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X.

# Пример:
# 5
# 1 2 3 4 5
# 3
# -> 1

list_numbers = [int(input("Введите значения: "))
                for _ in range(int(input("Введите количество элементов: ")))]
print(list_numbers.count(int(input("Введите искомое число: "))))
